/* automatically generated by rust-bindgen 0.65.1 */

pub const _ERRNO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 39;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const slurm_err_t_ESLURM_JOB_NOT_FEDERATED: slurm_err_t = 7103;
pub const slurm_err_t_ESLURM_INVALID_CLUSTER_NAME: slurm_err_t = 7104;
pub const slurm_err_t_ESLURM_FED_JOB_LOCK: slurm_err_t = 7105;
pub const slurm_err_t_ESLURM_FED_NO_VALID_CLUSTERS: slurm_err_t = 7106;
pub const slurm_err_t_ESLURM_MISSING_TIME_LIMIT: slurm_err_t = 8000;
pub const slurm_err_t_ESLURM_INVALID_KNL: slurm_err_t = 8001;
pub const slurm_err_t_ESLURM_PLUGIN_INVALID: slurm_err_t = 8002;
pub const slurm_err_t_ESLURM_PLUGIN_INCOMPLETE: slurm_err_t = 8003;
pub const slurm_err_t_ESLURM_PLUGIN_NOT_LOADED: slurm_err_t = 8004;
pub const slurm_err_t_ESLURM_PLUGIN_NOTFOUND: slurm_err_t = 8005;
pub const slurm_err_t_ESLURM_PLUGIN_ACCESS_ERROR: slurm_err_t = 8006;
pub const slurm_err_t_ESLURM_PLUGIN_DLOPEN_FAILED: slurm_err_t = 8007;
pub const slurm_err_t_ESLURM_PLUGIN_INIT_FAILED: slurm_err_t = 8008;
pub const slurm_err_t_ESLURM_PLUGIN_MISSING_NAME: slurm_err_t = 8009;
pub const slurm_err_t_ESLURM_PLUGIN_BAD_VERSION: slurm_err_t = 8010;
pub const slurm_err_t_ESLURM_REST_INVALID_QUERY: slurm_err_t = 9000;
pub const slurm_err_t_ESLURM_REST_FAIL_PARSING: slurm_err_t = 9001;
pub const slurm_err_t_ESLURM_REST_INVALID_JOBS_DESC: slurm_err_t = 9002;
pub const slurm_err_t_ESLURM_REST_EMPTY_RESULT: slurm_err_t = 9003;
pub const slurm_err_t_ESLURM_REST_MISSING_UID: slurm_err_t = 9004;
pub const slurm_err_t_ESLURM_REST_MISSING_GID: slurm_err_t = 9005;
pub const slurm_err_t_ESLURM_DATA_PATH_NOT_FOUND: slurm_err_t = 9200;
pub const slurm_err_t_ESLURM_DATA_PTR_NULL: slurm_err_t = 9201;
pub const slurm_err_t_ESLURM_DATA_CONV_FAILED: slurm_err_t = 9202;
pub const slurm_err_t_ESLURM_DATA_REGEX_COMPILE: slurm_err_t = 9203;
pub const slurm_err_t_ESLURM_DATA_UNKNOWN_MIME_TYPE: slurm_err_t = 9204;
pub const slurm_err_t_ESLURM_DATA_TOO_LARGE: slurm_err_t = 9205;
pub const slurm_err_t_ESLURM_DATA_FLAGS_INVALID_TYPE: slurm_err_t = 9206;
pub const slurm_err_t_ESLURM_DATA_FLAGS_INVALID: slurm_err_t = 9207;
pub const slurm_err_t_ESLURM_DATA_EXPECTED_LIST: slurm_err_t = 9208;
pub const slurm_err_t_ESLURM_DATA_EXPECTED_DICT: slurm_err_t = 9209;
pub const slurm_err_t_ESLURM_DATA_AMBIGUOUS_MODIFY: slurm_err_t = 9210;
pub const slurm_err_t_ESLURM_DATA_AMBIGUOUS_QUERY: slurm_err_t = 9211;
pub const slurm_err_t_ESLURM_DATA_PARSE_NOTHING: slurm_err_t = 9212;
pub const slurm_err_t_ESLURM_DATA_INVALID_PARSER: slurm_err_t = 9213;
pub const slurm_err_t_ESLURM_CONTAINER_NOT_CONFIGURED: slurm_err_t = 10000;
pub type slurm_err_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slurm_errtab_t {
    pub xe_number: ::std::os::raw::c_int,
    pub xe_name: *mut ::std::os::raw::c_char,
    pub xe_message: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_slurm_errtab_t() {
    const UNINIT: ::std::mem::MaybeUninit<slurm_errtab_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<slurm_errtab_t>(),
        24usize,
        concat!("Size of: ", stringify!(slurm_errtab_t))
    );
    assert_eq!(
        ::std::mem::align_of::<slurm_errtab_t>(),
        8usize,
        concat!("Alignment of ", stringify!(slurm_errtab_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xe_number) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slurm_errtab_t),
            "::",
            stringify!(xe_number)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xe_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(slurm_errtab_t),
            "::",
            stringify!(xe_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xe_message) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(slurm_errtab_t),
            "::",
            stringify!(xe_message)
        )
    );
}
extern "C" {
    pub static mut slurm_errtab: [slurm_errtab_t; 0usize];
}
extern "C" {
    pub static mut slurm_errtab_size: ::std::os::raw::c_uint;
}
extern "C" {
    pub fn slurm_strerror(errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn slurm_seterrno(errnum: ::std::os::raw::c_int);
}
extern "C" {
    pub fn slurm_get_errno() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn slurm_perror(msg: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spank_handle {
    _unused: [u8; 0],
}
pub type spank_t = *mut spank_handle;
pub type spank_f = ::std::option::Option<
    unsafe extern "C" fn(
        spank: spank_t,
        ac: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn slurm_spank_init(
